app/controllers/invoices_controller.rb

  def create
    attrs = invoice_params.merge(account_id: current_tenant.id)
    invoice = Invoice.new(attrs)
    invoice.invoice_lines.build(invoice_lines_params[:invoice_lines])
    if invoice.valid?
      saved_invoice = InvoiceService.save_invoice(invoice)
---
INSERT INTO "invoices" ("account_id", "due_date", "invoice_date", "client_id", "currency_id", "invoice_number", "total_amount", "total_tax", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"