app/controllers/taxes_controller.rb

  def create
    tax = Tax.new(tax_params)
    tax.account_id = current_tenant.id
    if tax.save
---
INSERT INTO "taxes" ("name", "description", "amount", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"